In [60]:
import pandas as pd
import os

In [61]:
root = os.getcwd()

In [62]:
base = pd.read_csv(root + '/data/coleta_mes.csv', encoding='latin1', sep=';')
base = base[['Código do Município - IBGE', 'Volume coletado(L)']]
base.columns = ['cid_ibge', 'volumes_mes']
base

        cid_ibge  volumes_mes
0        5300108       514750
1        5200050          600
2        5200134         2720
3        5200258        11300
4        5200555        30630
...          ...          ...
254080   3556602         1150
254081   3556701        29265
254082   3556909         3685
254083   3557006        20810
254084   3557105        26533

[254085 rows x 2 columns]

In [63]:
# Group by cid_ibge and get the mean of volume
base = base.groupby('cid_ibge').mean().reset_index()
base['volume_dia'] = base['volumes_mes']/ 30
base['volume_lw'] = base['volume_dia'] * 0.4
base

      cid_ibge    volumes_mes    volume_dia    volume_lw
0      1100015   12070.852459    402.361749   160.944699
1      1100023   15162.406250    505.413542   202.165417
2      1100031     884.692308     29.489744    11.795897
3      1100049   27272.562500    909.085417   363.634167
4      1100056    1283.901961     42.796732    17.118693
...        ...            ...           ...          ...
4996   5222005    1172.600000     39.086667    15.634667
4997   5222054    6329.738636    210.991288    84.396515
4998   5222203    2280.740741     76.024691    30.409877
4999   5222302    1505.000000     50.166667    20.066667
5000   5300108  600909.208333  20030.306944  8012.122778

[5001 rows x 4 columns]

In [64]:
base.to_csv(root + '/data/volume_dia.csv', index=False)